%% 两级电力市场环境下计及风险的省间交易商最优购电模型
%电网技术论文复现
%双层规划,节点出清价,绿证交易,CVaR方法
 

clc
clear
close all

%% 参数设定
P_G=sdpvar(5,24); %省内发电机组的出清电能,分别为火电、水电、光伏发电、风电、气电
P_IP_D=sdpvar(1,24); %省间交易商在省间市场的购电量
P_R=sdpvar(5,24); %省内发电机组的备用容量
P_IP_G_A=sdpvar(5,24); %送端省A的各个发电机组的出清电能
P_IP_G_B=sdpvar(5,24); %送端省B的各个发电机组的出清电能
P_IP_G_C=sdpvar(5,24); %送端省C的各个发电机组的出清电能
lambda=sdpvar(1,24); %下层等式约束的对偶变量
miu_1_max=sdpvar(3,24); %式(11)的上限对偶变量
miu_1_min=sdpvar(3,24); %式(11)的下限对偶变量
miu_2_A_max=sdpvar(5,24); %式(12)中的送端省A中发电机组的上限对偶变量
miu_2_A_min=sdpvar(5,24); %式(12)中的送端省A中发电机组的下限对偶变量
miu_2_B_max=sdpvar(5,24); %式(12)中的送端省B中发电机组的上限对偶变量
miu_2_B_min=sdpvar(5,24); %式(12)中的送端省B中发电机组的下限对偶变量
miu_2_C_max=sdpvar(5,24); %式(12)中的送端省C中发电机组的上限对偶变量
miu_2_C_min=sdpvar(5,24); %式(12)中的送端省C中发电机组的下限对偶变量
v1=binvar(3,24); %辅助布尔变量
v2=binvar(3,24);
v3_A=binvar(5,24);
v4_A=binvar(5,24);
v3_B=binvar(5,24);
v4_B=binvar(5,24);
v3_C=binvar(5,24);
v4_C=binvar(5,24);
xi=sdpvar(1,1); %省内市场运行成本的VaR值
chi=sdpvar(1,1); %非负辅助变量
M=1e6;
%% 系统中常数参数导入
%省内t时段的负荷需求,单位为MW
P_D=[53783,53783,50551,48174,47319,47921,53641,59486,69087,76406,79543,78307,77167,76406,74695,75551,79543,80399,80399,80399,77167,66711,58821,58821];
P_wp=[2706,2838,2951,2800,2744,2725,2932,2951,3195,3251,3157,3458,3665,4003,3928,3402,2462,1503,1390,996,845,770,770,1860];
P_pv=[150,150,150,263,375,827,1127,1992,2593,4022,5601,6466,6334,5394,7706,6466,5413,5150,5075,1860,507,281,225,300];
%% 导入约束条件
C=[];
%上层优化模型的约束条件
C=[C,
   sum(P_G(1:5,:))+P_IP_D-P_D==0, %电力平衡约束
   sum(P_R(1:5,:))-0.05*P_D>=0, %备用容量约束
   -0.1*46350<=P_G(1,2:24)-P_G(1,1:23)<=0.1*46350, %火电机组的爬坡约束
   -0.5*12500<=P_G(2,2:24)-P_G(2,1:23)<=0.5*12500, %水电机组的爬坡约束
   -8000<=P_G(3,2:24)-P_G(3,1:23)<=8000, %光伏发电的爬坡约束
   -4000<=P_G(4,2:24)-P_G(4,1:23)<=4000, %风电的爬坡约束
   -0.3*7040<=P_G(5,2:24)-P_G(5,1:23)<=0.3*7040, %气电的爬坡约束
   0.5*46350<=P_G(1,:)+P_R(1,:)<=46350, %火电机组的出力约束
   0.1*12500<=P_G(2,:)+P_R(3,:)<=12500, %水电机组的出力约束
   0<=P_G(3,:)+P_R(3,:)<=8000, %光伏发电的出力约束
   0<=P_G(4,:)+P_R(4,:)<=4000, %风电的出力约束
   0<=P_G(3,:)+P_R(3,:)<=P_pv, %光伏发电的出力约束
   0<=P_G(4,:)+P_R(4,:)<=P_wp, %风电的出力约束
   0.3*7040<=P_G(5,:)+P_R(5,:)<=7040, %气电机组的出力约束
  ];
C=[C,P_G(1:5,:)>=0,P_R(1:5,:)>=0,P_IP_D>=0,]; %所有上层决策变量非负性约束
%下层问题的KKT条件
%原下层问题的等号约束条件
C=[C,(1-0.07)*sum(P_IP_G_A(1:5,:))+(1-0.065)*sum(P_IP_G_B(1:5,:))+(1-0.015)*sum(P_IP_G_C(1:5,:))==P_IP_D,]; %省间联络线电力平衡约束
%对偶问题的约束条件
%拉格朗日平稳性约束
C=[C,
   420+53.5-lambda*(1-0.07)+miu_1_max(1,:)-miu_1_min(1,:)+miu_2_A_max(1,:)-miu_2_A_min(1,:)==0,
   190+53.5-lambda*(1-0.07)+miu_1_max(1,:)-miu_1_min(1,:)+miu_2_A_max(2,:)-miu_2_A_min(2,:)==0,
   280+53.5-lambda*(1-0.07)+miu_1_max(1,:)-miu_1_min(1,:)+miu_2_A_max(3,:)-miu_2_A_min(3,:)==0,
   210+53.5-lambda*(1-0.07)+miu_1_max(1,:)-miu_1_min(1,:)+miu_2_A_max(4,:)-miu_2_A_min(4,:)==0,
   730+53.5-lambda*(1-0.07)+miu_1_max(1,:)-miu_1_min(1,:)+miu_2_A_max(5,:)-miu_2_A_min(5,:)==0,   
   420+49.5-lambda*(1-0.065)+miu_1_max(2,:)-miu_1_min(2,:)+miu_2_B_max(1,:)-miu_2_B_min(1,:)==0,
   190+49.5-lambda*(1-0.065)+miu_1_max(2,:)-miu_1_min(2,:)+miu_2_B_max(2,:)-miu_2_B_min(2,:)==0,
   280+49.5-lambda*(1-0.065)+miu_1_max(2,:)-miu_1_min(2,:)+miu_2_B_max(3,:)-miu_2_B_min(3,:)==0,
   210+49.5-lambda*(1-0.065)+miu_1_max(2,:)-miu_1_min(2,:)+miu_2_B_max(4,:)-miu_2_B_min(4,:)==0,
   730+49.5-lambda*(1-0.065)+miu_1_max(2,:)-miu_1_min(2,:)+miu_2_B_max(5,:)-miu_2_B_min(5,:)==0,  
   420+10.0-lambda*(1-0.015)+miu_1_max(3,:)-miu_1_min(3,:)+miu_2_C_max(1,:)-miu_2_C_min(1,:)==0,
   190+10.0-lambda*(1-0.015)+miu_1_max(3,:)-miu_1_min(3,:)+miu_2_C_max(2,:)-miu_2_C_min(2,:)==0,
   280+10.0-lambda*(1-0.015)+miu_1_max(3,:)-miu_1_min(3,:)+miu_2_C_max(3,:)-miu_2_C_min(3,:)==0,
   210+10.0-lambda*(1-0.015)+miu_1_max(3,:)-miu_1_min(3,:)+miu_2_C_max(4,:)-miu_2_C_min(4,:)==0,
   730+10.0-lambda*(1-0.015)+miu_1_max(3,:)-miu_1_min(3,:)+miu_2_C_max(5,:)-miu_2_C_min(5,:)==0,
  ];
%互补松弛条件
C=[C,
   %送端省A的部分
   0<=miu_1_min(1,:)<=M*(1-v1(1,:)),
   0<=sum(P_IP_G_A(1:5,:))-0<=M*v1(1,:),
   0<=8000-sum(P_IP_G_A(1:5,:))<=M*v2(1,:),
   0<=miu_1_max(1,:)<=M*(1-v2(1,:)),
   0<=P_IP_G_A(1,:)-0<=M*v3_A(1,:),
   0<=miu_2_A_min(1,:)<=M*(1-v3_A(1,:)),
   0<=5060-P_IP_G_A(1,:)<=M*v4_A(1,:),
   0<=miu_2_A_max(1,:)<=M*(1-v4_A(1,:)),
   0<=P_IP_G_A(2,:)-0<=M*v3_A(2,:),
   0<=miu_2_A_min(2,:)<=M*(1-v3_A(2,:)),
   0<=1900-P_IP_G_A(2,:)<=M*v4_A(2,:),
   0<=miu_2_A_max(2,:)<=M*(1-v4_A(2,:)),
   0<=P_IP_G_A(3,:)-0<=M*v3_A(3,:),
   0<=miu_2_A_min(3,:)<=M*(1-v3_A(3,:)),
   0<=1980-P_IP_G_A(3,:)<=M*v4_A(3,:),
   0<=miu_2_A_max(3,:)<=M*(1-v4_A(3,:)),
   0<=P_IP_G_A(4,:)-0<=M*v3_A(4,:),
   0<=miu_2_A_min(4,:)<=M*(1-v3_A(4,:)),
   0<=2800-P_IP_G_A(4,:)<=M*v4_A(4,:),
   0<=miu_2_A_max(4,:)<=M*(1-v4_A(4,:)),
   0<=P_IP_G_A(5,:)-0<=M*v3_A(5,:),
   0<=miu_2_A_min(5,:)<=M*(1-v3_A(5,:)),
   0<=1200-P_IP_G_A(5,:)<=M*v4_A(5,:),
   0<=miu_2_A_max(5,:)<=M*(1-v4_A(5,:)),
   %送端省B的部分
   0<=miu_1_min(2,:)<=M*(1-v1(2,:)),
   0<=sum(P_IP_G_B(1:5,:))-0<=M*v1(2,:),
   0<=8000-sum(P_IP_G_B(1:5,:))<=M*v2(2,:),
   0<=miu_1_max(2,:)<=M*(1-v2(2,:)),
   0<=P_IP_G_B(1,:)-0<=M*v3_B(1,:),
   0<=miu_2_B_min(1,:)<=M*(1-v3_B(1,:)),
   0<=1120-P_IP_G_B(1,:)<=M*v4_B(1,:),
   0<=miu_2_B_max(1,:)<=M*(1-v4_B(1,:)),
   0<=P_IP_G_B(2,:)-0<=M*v3_B(2,:),
   0<=miu_2_B_min(2,:)<=M*(1-v3_B(2,:)),
   0<=6640-P_IP_G_B(2,:)<=M*v4_B(2,:),
   0<=miu_2_B_max(2,:)<=M*(1-v4_B(2,:)),
   0<=P_IP_G_B(3,:)-0<=M*v3_B(3,:),
   0<=miu_2_B_min(3,:)<=M*(1-v3_B(3,:)),
   0<=200-P_IP_G_B(3,:)<=M*v4_B(3,:),
   0<=miu_2_B_max(3,:)<=M*(1-v4_B(3,:)),
   0<=P_IP_G_B(4,:)-0<=M*v3_B(4,:),
   0<=miu_2_B_min(4,:)<=M*(1-v3_B(4,:)),
   0<=480-P_IP_G_B(4,:)<=M*v4_B(4,:),
   0<=miu_2_B_max(4,:)<=M*(1-v4_B(4,:)),
   0<=P_IP_G_B(5,:)-0<=M*v3_B(5,:),
   0<=miu_2_B_min(5,:)<=M*(1-v3_B(5,:)),
   0<=168-P_IP_G_B(5,:)<=M*v4_B(5,:),
   0<=miu_2_B_max(5,:)<=M*(1-v4_B(5,:)),
   %送端省C的部分
   0<=miu_1_min(3,:)<=M*(1-v1(3,:)),
   0<=sum(P_IP_G_C(1:5,:))-0<=M*v1(3,:),
   0<=18000-sum(P_IP_G_C(1:5,:))<=M*v2(3,:),
   0<=miu_1_max(3,:)<=M*(1-v2(3,:)),
   0<=P_IP_G_C(1,:)-0<=M*v3_C(1,:),
   0<=miu_2_C_min(1,:)<=M*(1-v3_C(1,:)),
   0<=7536-P_IP_G_C(1,:)<=M*v4_C(1,:),
   0<=miu_2_C_max(1,:)<=M*(1-v4_C(1,:)),
   0<=P_IP_G_C(2,:)-0<=M*v3_C(2,:),
   0<=miu_2_C_min(2,:)<=M*(1-v3_C(2,:)),
   0<=1360-P_IP_G_C(2,:)<=M*v4_C(2,:),
   0<=miu_2_C_max(2,:)<=M*(1-v4_C(2,:)),
   0<=P_IP_G_C(3,:)-0<=M*v3_C(3,:),
   0<=miu_2_C_min(3,:)<=M*(1-v3_C(3,:)),
   0<=1200-P_IP_G_C(3,:)<=M*v4_C(3,:),
   0<=miu_2_C_max(3,:)<=M*(1-v4_C(3,:)),
   0<=P_IP_G_C(4,:)-0<=M*v3_C(4,:),
   0<=miu_2_C_min(4,:)<=M*(1-v3_C(4,:)),
   0<=1500-P_IP_G_C(4,:)<=M*v4_C(4,:),
   0<=miu_2_C_max(4,:)<=M*(1-v4_C(4,:)),
   0<=P_IP_G_C(5,:)-0<=M*v3_C(5,:),
   0<=miu_2_C_min(5,:)<=M*(1-v3_C(5,:)),
   0<=772-P_IP_G_C(5,:)<=M*v4_C(5,:),
   0<=miu_2_C_max(5,:)<=M*(1-v4_C(5,:)),
  ];
%% 导入目标函数
%通过强对偶定理消去双线性项
Oc=420*sum(P_G(1,:))+190*sum(P_G(2,:))+280*sum(P_G(3,:))+210*sum(P_G(4,:))+730*sum(P_G(5,:))+...
    0.05*420*sum(P_R(1,:))+0.05*190*sum(P_R(2,:))+0.05*280*sum(P_R(3,:))+0.05*210*sum(P_R(4,:))+0.05*730*sum(P_R(5,:))+...
    0+8000*sum(miu_1_max(1,:))+8000*sum(miu_1_max(2,:))+18000*sum(miu_1_max(3,:))+...
    sum(miu_2_A_max(1,:)*5060)+sum(miu_2_A_max(2,:)*1900)+sum(miu_2_A_max(3,:)*1980)+sum(miu_2_A_max(4,:)*2800)+sum(miu_2_A_max(5,:)*1200)+...
    sum(miu_2_B_max(1,:)*1120)+sum(miu_2_B_max(2,:)*6640)+sum(miu_2_B_max(3,:)*200)+sum(miu_2_B_max(4,:)*480)+sum(miu_2_B_max(5,:)*168)+...
    sum(miu_2_C_max(1,:)*7536)+sum(miu_2_C_max(2,:)*1360)+sum(miu_2_C_max(3,:)*1200)+sum(miu_2_C_max(4,:)*1500)+sum(miu_2_C_max(5,:)*772)-...
    (420+53.5)*sum(P_IP_G_A(1,:))-(190+53.5)*sum(P_IP_G_A(2,:))-(280+53.5)*sum(P_IP_G_A(3,:))-(210+53.5)*sum(P_IP_G_A(4,:))-(730+53.5)*sum(P_IP_G_A(5,:))-...
    (420+49.5)*sum(P_IP_G_B(1,:))-(190+49.5)*sum(P_IP_G_B(2,:))-(280+49.5)*sum(P_IP_G_B(3,:))-(210+49.5)*sum(P_IP_G_B(4,:))-(730+49.5)*sum(P_IP_G_B(5,:))-...
    (420+10.0)*sum(P_IP_G_C(1,:))-(190+10.0)*sum(P_IP_G_C(2,:))-(280+10.0)*sum(P_IP_G_C(3,:))-(210+10.0)*sum(P_IP_G_C(4,:))-(730+10.0)*sum(P_IP_G_C(5,:));
C=[C,Oc-xi-chi<=0,chi>=0,]; %CVaR的约束条件
C_VAR=xi+1/(1-0.7)*chi;
Obj=Oc+1*C_VAR; %实际的目标函数
%% 模型求解
ops=sdpsettings('solver','cplex','verbose',2,'usex0',0);
ops.cplex.mip.tolerances.mipgap=1;
result=optimize(C,Obj,ops);

if result.problem == 0 % problem =0 代表求解成功
else
    error('求解出错');
end
%% 数据导出及画图
P_G=double(P_G);
%省内各类机组出清电能
for t=1:24
    Plot_Chuqing(1,t)=P_G(1,t);
    Plot_Chuqing(2,t)=P_G(2,t);
    Plot_Chuqing(3,t)=P_G(3,t);
    Plot_Chuqing(4,t)=P_G(4,t);
    Plot_Chuqing(5,t)=P_G(5,t);
end
Plot_Chuqing=Plot_Chuqing';
figure
h=bar(Plot_Chuqing,'stacked');
xlabel('时刻');
ylabel('省内各类机组出力/MW');
title('省内各类机组出清电能');
legend('火电','水电','光伏发电','风电','气电');
legend('boxoff');
box off
%省间联络线潮流变化情况
P_IP_G_A=double(P_IP_G_A);P_IP_G_B=double(P_IP_G_B);P_IP_G_C=double(P_IP_G_C);
for t=1:24
    Plot_Chaoliu(1,t)=sum(P_IP_G_A(1:5,t));
    Plot_Chaoliu(2,t)=sum(P_IP_G_B(1:5,t));
    Plot_Chaoliu(3,t)=sum(P_IP_G_C(1:5,t));
end
figure
stairs(Plot_Chaoliu(1,:),'b-','LineWidth',1.5);
hold on
stairs(Plot_Chaoliu(2,:),'g-','LineWidth',1.5);
hold on
stairs(Plot_Chaoliu(3,:),'r-','LineWidth',1.5);
xlabel('时刻');
ylabel('省间联络线潮流/MW');
title('省间联络线潮流变化情况');
legend('省间联络线1','省间联络线2','省间联络线3');
legend('boxoff');
box off
%省间电能交易的出清价格
lambda=double(lambda);
figure
plot(lambda,'b--','LineWidth',1.5)
xlabel('时刻');
ylabel('价格/(元/MWh)');
title('省间电能交易的出清价格');
box off